tap "apple/apple", trusted: true
tap "brewforge/chinese", trusted: true
tap "brewforge/extras", trusted: true
tap "charmbracelet/tap", trusted: true
tap "esengine/reasonix", trusted: true
tap "homebrew/cask"
tap "homebrew/core"
tap "ivanwng97/pixtuoid", trusted: true
tap "steipete/tap", trusted: true
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Text-based UI library
brew "ncurses"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Compiler infrastructure and toolchain library for WebAssembly
brew "binaryen"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Next-generation test runner for Rust
brew "cargo-nextest"
# CLI tool for analyzing Claude Code usage from local JSONL files
brew "ccusage"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Highly customizable changelog generator
brew "git-cliff"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Post-modern modal text editor
brew "helix"
# Self-improving AI agent that creates skills from experience
brew "hermes-agent"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Handy way to save and run project-specific commands
brew "just"
# Simple terminal UI for git commands
brew "lazygit"
# May the code be with you
brew "leetcode-cli"
# Next-gen compiler infrastructure
brew "llvm"
# Parsing Expression Grammars For Lua
brew "lpeg"
# Fast, async, resource-friendly link checker
brew "lychee"
# Mac App Store command-line interface
brew "mas"
# Experimental optional static type checker for Python
brew "mypy"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Your own personal AI assistant
brew "openclaw-cli"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Development kit for the Java programming language
brew "openjdk"
# Painless compression and decompression for your terminal
brew "ouch"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Static type checker for Python
brew "pyright"
# Rsync for cloud storage
brew "rclone"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Terminal multiplexer
brew "tmux"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A tool for recording terminal GIFs
brew "charmbracelet/tap/vhs"
# Terminal pixel-art office for AI coding agents
brew "ivanwng97/pixtuoid/pixtuoid", trusted: true
# Send and read iMessage / SMS from the terminal
brew "steipete/tap/imsg", trusted: true
# Stand alone ad blocker
cask "adguard"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Agent orchestration platform
cask "antigravity"
# Terminal interface for Antigravity agents
cask "antigravity-cli"
# Cloud storage service
cask "baidunetdisk"
# E-books management software
cask "calibre"
# Rule based proxy base on Clash
cask "brewforge/chinese/clashx-meta"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# All-in-one toolbox for developers
cask "devutils"
# Voice and text chat software
cask "discord"
# Downloads videos from different websites
cask "downie"
# Download manager with a torrent client
cask "folx"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty@tip"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Tool for multi-language users
cask "input-source-pro"
# File archiver
cask "keka"
# Media player
cask "movist-pro"
# Converts and edits video, audio or image files
cask "permute"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# 电脑高效拍档，一键存爽快看
cask "brewforge/chinese/quarkclouddrive"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# Cache-first DeepSeek coding agent for the terminal.
cask "esengine/reasonix/reasonix", trusted: true
# Team communication and collaboration software
cask "slack"
# Sound and audio controller
cask "soundsource"
# Quicklook extension for source files
cask "syntax-highlight"
# Messaging app with a focus on speed and security
cask "telegram"
# VPN and WiFi proxy
cask "thunder"
# Web browser focusing on security
cask "tor-browser"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "webex"
# Free messaging and calling application
cask "wechat"
# Video communication and virtual meeting platform
cask "zoom"
mas "Capital One Shopping", id: 1477110326
mas "CardPointers", id: 1472875808
mas "Craft/ Write docs, AI editing", id: 0
mas "Endel", id: 1484348796
mas "Infuse", id: 0
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Noir", id: 1592917505
mas "Numbers", id: 361304891
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Rakuten Cash Back", id: 1451893560
mas "Reeder", id: 1529448980
mas "Tampermonkey", id: 6738342400
mas "TestFlight", id: 899247664
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "bmalehorn.vscode-fish"
vscode "bradlc.vscode-tailwindcss"
vscode "bytedance-microapp.microapp"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "fwcd.kotlin"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "kdl-org.kdl"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "lynx.lynx-studio"
vscode "mintlify.document"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "pablodelucca.pixel-agents"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
cargo "cargo-deny"
cargo "cargo-edit"
cargo "cargo-hack"
cargo "cargo-insta"
cargo "cargo-llvm-cov"
cargo "cargo-machete"
cargo "cargo-mutants"
cargo "cargo-outdated"
cargo "cargo-semver-checks"
cargo "lifecycler"
cargo "pixtuoid-hook"
cargo "wasm-bindgen-cli"
npm "codewhale"
npm "corepack"
npm "neovim"
npm "pnpm"
npm "wrangler"
npm "yarn"
